/**
 * Анимации, которые умеет проигрывать актор. Названия описывают, что делает персонаж, а не то,
 * какой анимацией игры это показано. Анимации могут быть незаконченными: например, «начать рыться
 * в мусорке», «рыться в мусорке» и «перестать рыться» — отдельные анимации, в цепочку их собирает
 * тот, кто ими управляет
 */
export type AnimationId =
  /** Приступить к рытью в мусорке */
  | 'trash-search-start'
  /** Рыться в мусорке */
  | 'trash-search'
  /** Посмотреть, что нашёл в мусорке, вариант 1 */
  | 'trash-search-look-1'
  /** Посмотреть, что нашёл в мусорке, вариант 2 */
  | 'trash-search-look-2'
  /** Положить найденное в карман */
  | 'trash-search-pocket'
  /** Перестать рыться в мусорке */
  | 'trash-search-end'
  /** Попрошайничать сидя */
  | 'beg-sitting'
  /** Отдать предмет */
  | 'item-give'
  /** Получить предмет */
  | 'item-receive'
  /** Оплатить что-либо */
  | 'pay'
  /** Пить стоя, вариант 1 */
  | 'drink-standing-1'
  /** Пить стоя, вариант 2 */
  | 'drink-standing-2';
